garyPenhook/PyAvrOCD/svd/attiny3216.svd
        <register>
          <name>ASYNCUSER5</name>
          <description>Asynchronous User Ch 5 Input Selection - CCL LUT1 Event 1</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER5</name>
              <description>Asynchronous User Ch 5 Input Selection - CCL LUT1 Event 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER6</name>
          <description>Asynchronous User Ch 6 Input Selection - TCD0 Event 0</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER6</name>
              <description>Asynchronous User Ch 6 Input Selection - TCD0 Event 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER7</name>
          <description>Asynchronous User Ch 7 Input Selection - TCD0 Event 1</description>
          <addressOffset>0x19</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER7</name>
              <description>Asynchronous User Ch 7 Input Selection - TCD0 Event 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER8</name>
          <description>Asynchronous User Ch 8 Input Selection - Event Out 0</description>
          <addressOffset>0x1A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER8</name>
              <description>Asynchronous User Ch 8 Input Selection - Event Out 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER9</name>
          <description>Asynchronous User Ch 9 Input Selection - Event Out 1</description>
          <addressOffset>0x1B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER9</name>
              <description>Asynchronous User Ch 9 Input Selection - Event Out 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCCH0</name>
          <description>Synchronous Channel 0 Generator Selection</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYNCCH0</name>
              <description>Synchronous Channel 0 Generator Selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0</name>
                  <description>Timer/Counter B0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_OVF_LUNF</name>
                  <description>Timer/Counter A0 overflow</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_HUNF</name>
                  <description>Timer/Counter A0 underflow high byte (split mode)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP0</name>
                  <description>Timer/Counter A0 compare 0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP1</name>
                  <description>Timer/Counter A0 compare 1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP2</name>
                  <description>Timer/Counter A0 compare 2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN0</name>
                  <description>Synchronous Event from Pin PC0</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN1</name>
                  <description>Synchronous Event from Pin PC1</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN2</name>
                  <description>Synchronous Event from Pin PC2</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN3</name>
                  <description>Synchronous Event from Pin PC3</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN4</name>
                  <description>Synchronous Event from Pin PC4</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN5</name>
                  <description>Synchronous Event from Pin PC5</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN0</name>
                  <description>Synchronous Event from Pin PA0</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN1</name>
                  <description>Synchronous Event from Pin PA1</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN2</name>
                  <description>Synchronous Event from Pin PA2</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN3</name>
                  <description>Synchronous Event from Pin PA3</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN4</name>
                  <description>Synchronous Event from Pin PA4</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN5</name>
                  <description>Synchronous Event from Pin PA5</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN6</name>
                  <description>Synchronous Event from Pin PA6</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN7</name>
                  <description>Synchronous Event from Pin PA7</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1</name>
                  <description>Timer/Counter B1</description>
                  <value>21</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCCH1</name>
          <description>Synchronous Channel 1 Generator Selection</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYNCCH1</name>
              <description>Synchronous Channel 1 Generator Selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0</name>
                  <description>Timer/Counter B0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_OVF_LUNF</name>
                  <description>Timer/Counter A0 overflow</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_HUNF</name>
                  <description>Timer/Counter A0 underflow high byte (split mode)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP0</name>
                  <description>Timer/Counter A0 compare 0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP1</name>
                  <description>Timer/Counter A0 compare 1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP2</name>
                  <description>Timer/Counter A0 compare 2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN0</name>
                  <description>Synchronous Event from Pin PB0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN1</name>
                  <description>Synchronous Event from Pin PB1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN2</name>
                  <description>Synchronous Event from Pin PB2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN3</name>
                  <description>Synchronous Event from Pin PB3</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN4</name>
                  <description>Synchronous Event from Pin PB4</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN5</name>
                  <description>Synchronous Event from Pin PB5</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN6</name>
                  <description>Synchronous Event from Pin PB6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN7</name>
                  <description>Synchronous Event from Pin PB7</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1</name>
                  <description>Timer/Counter B1</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCSTROBE</name>
          <description>Synchronous Channel Strobe</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>write-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SYNCUSER0</name>
          <description>Synchronous User Ch 0 - TCA0</description>
          <addressOffset>0x22</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYNCUSER0</name>
              <description>Synchronous User Ch 0 - TCA0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
